ConfigurationFonecmidDiplomTuzeka/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ВКМ_МассовоеСозданиеАктов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВКМ_МассовоеСозданиеАктов</name>
  <attributes>
    <name>ВКМ_Период</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ВКМ_Договоры</name>
    <attributes>
      <name>ВКМ_Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>ВКМ_Реализация</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>ВКМ_Статус</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

ConfigurationFonecmidDiplomTuzeka/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/Forms/ВКМ_ФормаОбработки/Module.bsl
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВКМ_Выполнить(Команда)

	Если Не ЗначениеЗаполнено(Объект.ВКМ_Период) Тогда
		ПоказатьПредупреждение(, "Укажите период.");
		Возврат;
	КонецЕсли;

	ДлительнаяОперация = ВКМ_ЗапуститьВыполнениеНаСервере(УникальныйИдентификатор);

	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Истина;

	Обработчик = Новый ОписаниеОповещения("ВКМ_ВыполнениеЗавершение", ЭтотОбъект);

	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Обработчик, ПараметрыОжидания);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ВКМ_ЗапуститьВыполнениеНаСервере(Знач УникальныйИдентификатор)

	ПараметрыПроцедуры = Новый Структура("Период", Объект.ВКМ_Период);

	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Массовое создание актов'");
	ПараметрыВыполнения.ОжидатьЗавершение = 0;

	Возврат ДлительныеОперации.ВыполнитьВФоне("Обработки.ВКМ_МассовоеСозданиеАктов.ВКМ_СоздатьАкты",
		ПараметрыПроцедуры, ПараметрыВыполнения);

КонецФункции

&НаКлиенте
Процедура ВКМ_ВыполнениеЗавершение(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если Результат.Статус = "Выполнено" Тогда
		ВКМ_ЗагрузитьРезультатНаСервере(Результат.АдресРезультата);
	Иначе
		ПоказатьПредупреждение(, "Ошибка выполнения: " + Результат.КраткоеПредставлениеОшибки);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ВКМ_ЗагрузитьРезультатНаСервере(Знач АдресРезультата)

	ТаблицаРезультата = ПолучитьИзВременногоХранилища(АдресРезультата);

	Объект.ВКМ_Договоры.Очистить();

	Для Каждого СтрокаРезультата Из ТаблицаРезультата Цикл
		НоваяСтрока = Объект.ВКМ_Договоры.Добавить();
		НоваяСтрока.ВКМ_Договор = СтрокаРезультата.ВКМ_Договор;
		НоваяСтрока.ВКМ_Реализация = СтрокаРезультата.ВКМ_Реализация;
		НоваяСтрока.ВКМ_Статус = СтрокаРезультата.ВКМ_Статус;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти
